src/Documents/КорректировкаДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>КорректировкаДвижений</Name>
			<Comment>Корректировка движений документов</Comment>
			<BasedOn>
				<xr:Item>Document.АктПриемаПередачиЦенныхБумаг</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.Амортизация</xr:Item>
				<xr:Item>Document.БюджетДДС</xr:Item>
				<xr:Item>Document.БюджетДоходовИРасходов</xr:Item>
				<xr:Item>Document.БюджетЗакупок</xr:Item>
				<xr:Item>Document.БюджетПродаж</xr:Item>
				<xr:Item>Document.ВводОстатковВзаиморасчетов</xr:Item>
				<xr:Item>Document.ВводВЭксплуатацию</xr:Item>
				<xr:Item>Document.ВводОстатковПрочихАктивов</xr:Item>
				<xr:Item>Document.ВводОстатковТоваров</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.Взаимозачет</xr:Item>
				<xr:Item>Document.Выписка</xr:Item>
				<xr:Item>Document.ВыплатаЗарплаты</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказВнутренний</xr:Item>
				<xr:Item>Document.ЗакрытиеСмены</xr:Item>
				<xr:Item>Document.ИзменениеАссортиментаПодразделения</xr:Item>
				<xr:Item>Document.ИзменениеЦен</xr:Item>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ИнвентаризацияОрдерногоСклада</xr:Item>
				<xr:Item>Document.Инкассация</xr:Item>
				<xr:Item>Document.Комплектация</xr:Item>
				<xr:Item>Document.КорректировкаДолга</xr:Item>
				<xr:Item>Document.КорректировкаЗаказаПоставщику</xr:Item>
				<xr:Item>Document.ОбслуживаниеАктива</xr:Item>
				<xr:Item>Document.НачислениеЗарплаты</xr:Item>
				<xr:Item>Document.КорректировкаЗаказаПокупателя</xr:Item>
				<xr:Item>Document.ОтчетКомитенту</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.ПеремещениеАктивов</xr:Item>
				<xr:Item>Document.ПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.Переоценка</xr:Item>
				<xr:Item>Document.ПереоценкаВалютныхСредств</xr:Item>
				<xr:Item>Document.ПереразмещениеТоваров</xr:Item>
				<xr:Item>Document.ПересортицаТоваров</xr:Item>
				<xr:Item>Document.ПланФакт</xr:Item>
				<xr:Item>Document.ПоступлениеДопРасходов</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.Разукомплектация</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйСкладскойОрдер</xr:Item>
				<xr:Item>Document.РеализацияАктивов</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.РезервированиеЗаказовПокупателя</xr:Item>
				<xr:Item>Document.СнятиеРезервовЗаказовПокупателя</xr:Item>
				<xr:Item>Document.СписаниеАктивов</xr:Item>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.СчетФактураПолученный</xr:Item>
				<xr:Item>Document.СчетФактураВыданный</xr:Item>
				<xr:Item>Document.Чек</xr:Item>
				<xr:Item>Document.ЧекНаОплату</xr:Item>
				<xr:Item>Document.ЗакрытиеПериода</xr:Item>
				<xr:Item>Document.НазначениеСкидокСтроки</xr:Item>
				<xr:Item>Document.НазначениеСкидокШапки</xr:Item>
				<xr:Item>Document.РаспределениеЗаказаПокупателя</xr:Item>
				<xr:Item>Document.ВводОстатковНакопительныхСумм</xr:Item>
				<xr:Item>Document.ЗаявкаНаРасходДС</xr:Item>
				<xr:Item>Document.ПланПоступленияДС</xr:Item>
				<xr:Item>Document.ЗаменаВЗаказеПокупателя</xr:Item>
				<xr:Item>Document.СнятиеРаспределенияЗаказовПокупателя</xr:Item>
				<xr:Item>Document.ПеремещениеРезервов</xr:Item>
				<xr:Item>Document.ЗаменаВЗаказеПоставщику</xr:Item>
				<xr:Item>Document.КорректировкаПоступления</xr:Item>
				<xr:Item>Document.КорректировкаРеализации</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.БюджетДДС</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.БюджетЗакупок</xr:Item>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарь</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ГТДПартийТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.КассыККМ</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыКомпании</xr:Item>
				<xr:Item>AccumulationRegister.БюджетПродаж</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеАктивыВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРаспределение</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровОтданные</xr:Item>
				<xr:Item>AccumulationRegister.НакопленияПоКарточкамКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровОрдерныйСклад</xr:Item>
				<xr:Item>AccumulationRegister.БюджетДоходовИРасходов</xr:Item>
				<xr:Item>AccumulationRegister.Планирование</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКомпании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьПерерасчетСкидок</Name>
					<Comment>Блокировать перерасчет скидок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДвиженияКорректировки</Name>
					<Comment>В этой табличной части хранятся названия регистров накопления участвующих в корректировке</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРегистра</Name>
							<Comment>Имя регистра накопления</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление регистра накопления</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Использование</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/КорректировкаДвижений/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Модуль основной формы документа "Корректировка"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура отрисовывает таблицу регистра на странице формы.
//
&НаСервере
Процедура ПоказатьТаблицуРегистраНаСтранице(ИмяРегистра)

	Если НЕ Элементы.Найти("Страница" + ИмяРегистра) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.РегистрыНакопления.Найти(ИмяРегистра) <> Неопределено Тогда
		
		СтраницаРегистра = Элементы.Страницы;
		ПредставлениеРегистра = Метаданные.РегистрыНакопления[ИмяРегистра].Синоним;
		
		Регистр = Метаданные.РегистрыНакопления[ИмяРегистра];
		
	ИначеЕсли Метаданные.РегистрыСведений.Найти(ИмяРегистра) <> Неопределено Тогда
		
		СтраницаРегистра = Элементы.Страницы;
		ПредставлениеРегистра = Метаданные.РегистрыСведений[ИмяРегистра].Синоним;
		
		Регистр = Метаданные.РегистрыСведений[ИмяРегистра];
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураРегистра = Новый Структура;
	СтруктураРегистра.Вставить("Период");
	СтруктураРегистра.Вставить("НомерСтроки");
	СтруктураРегистра.Вставить("Активность");
	СтруктураРегистра.Вставить("ВидДвижения");
	
	Для каждого СтандартныйРеквизит Из Регистр.СтандартныеРеквизиты Цикл
		Если СтруктураРегистра.Свойство(СтандартныйРеквизит.Имя) Тогда
			СтруктураРегистра[СтандартныйРеквизит.Имя] = СтандартныйРеквизит.Синоним;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Измерение Из Регистр.Измерения Цикл
		СтруктураРегистра.Вставить(Измерение.Имя, Измерение.Синоним);
	КонецЦикла;
	
	Для каждого Ресурс Из Регистр.Ресурсы Цикл
		СтруктураРегистра.Вставить(Ресурс.Имя, Ресурс.Синоним);
	КонецЦикла;
	
	Для каждого Реквизит Из Регистр.Реквизиты Цикл
		СтруктураРегистра.Вставить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
		
	СтраницаДляРегистра = СоздатьСтраницу("Страница" + ИмяРегистра, ПредставлениеРегистра, СтраницаРегистра,ВидГруппыФормы.Страница);
	СоздатьТаблицуРегистра(ИмяРегистра, СтруктураРегистра, СтраницаДляРегистра);
	
КонецПроцедуры // ПоказатьТаблицуРегистраНаСтранице()

// Функция создает страницу на форме.
//
&НаСервере
Функция СоздатьСтраницу(ИмяСтраницы, Заголовок, Родитель, ВидГруппыФормы)
	
	НовыйЭлемент = Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Родитель);
	НовыйЭлемент.Вид                      = ВидГруппыФормы;
	НовыйЭлемент.Заголовок                = Заголовок;
	НовыйЭлемент.РастягиватьПоВертикали   = Истина;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	НовыйЭлемент.ЦветФона                 = ЦветаСтиля.ЦветОсновнойПанелиФормы;
	
	Возврат НовыйЭлемент;
	
КонецФункции // СоздатьСтраницу()

// Процедура удаляет страницу на форме, соответствующую регистру.
//
&НаСервере
Процедура УдалитьСтраницуРегистра(ИмяСтраницы)
	
	Если НЕ Элементы.Найти(ИмяСтраницы) = Неопределено Тогда
		Элементы.Удалить(Элементы.Найти(ИмяСтраницы));
	КонецЕсли;
	
КонецПроцедуры // УдалитьСтраницуРегистра()

// Процедура создает на форме таблицу для регистра.
//
&НаСервере
Процедура СоздатьТаблицуРегистра(ИмяРегистра, Колонки, Родитель)
	
	ТаблицаФормы = Элементы.Добавить("ТаблицаДвижений" + ИмяРегистра, Тип("ТаблицаФормы"), Родитель);
	ТаблицаФормы.ПутьКДанным      = "Объект.Движения." + ИмяРегистра;
	Родитель.ПутьКДаннымЗаголовка = ТаблицаФормы.ПутьКДанным + ".КоличествоСтрок";
	Если Объект.ХозОперация = Справочники.ХозОперации.Сторно Тогда
		ТаблицаФормы.ИзменятьСоставСтрок = Ложь;
	КонецЕсли;
	
	Для Каждого Колонка Из Колонки Цикл
		
		Если Колонка.Значение <> Неопределено И НЕ (Колонка.Ключ = "Период" ИЛИ Колонка.Ключ = "НомерСтроки")Тогда
			
			ПолеФормы = Элементы.Добавить(ТаблицаФормы.Имя + Колонка.Ключ, Тип("ПолеФормы"), ТаблицаФормы);
			ПолеФормы.ПутьКДанным = ТаблицаФормы.ПутьКДанным + "." + Колонка.Ключ;
			ПолеФормы.Заголовок   = Колонка.Значение;
			Если Колонка.Ключ = "Активность" Тогда
				ПолеФормы.Вид = ВидПоляФормы.ПолеФлажка;
				ПолеФормы.ТолькоПросмотр = Истина;
			Иначе
				ПолеФормы.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли;
			
			Если Объект.ХозОперация = Справочники.ХозОперации.Сторно Тогда
				ПолеФормы.ТолькоПросмотр = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.ХозОперация = Справочники.ХозОперации.КорректировкаДвижений И (Колонки.Свойство("ПодразделениеКомпании") ИЛИ Колонки.Свойство("Организация")) Тогда
		ТаблицаФормы.УстановитьДействие("ПриНачалеРедактирования","ТаблицаДвиженийПриНачалеРедактирования");
	КонецЕсли;
	
КонецПроцедуры // СоздатьТаблицуРегистра()

// Процедура создает страницу со сторнирующими движениями
&НаСервере
Процедура ЗаполнитьДвиженияПоДокументуОснованию()
	
	ЕстьДвиженияДляКорректировки = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		УдалитьСтраницыРегистров();
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументаОснования = Объект.ДокументОснование.ПолучитьОбъект().Движения;
	Для Каждого ТекНаборЗаписей Из ДвиженияДокументаОснования Цикл
		ТекНаборЗаписей.Прочитать();
		Если ТекНаборЗаписей.Количество() <> 0 Тогда
			ЕстьДвиженияДляКорректировки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДвиженияДляКорректировки Тогда
		УстановитьСтраницыРегистровДляДокументаБезДвижений();
		Возврат;
	КонецЕсли;
	
	ДоступныеДвижения = Новый Массив;
	Для каждого Движение Из Метаданные.Документы.КорректировкаДвижений.Движения Цикл
		Если Объект.Движения[Движение.Имя].Количество() > 0 Тогда
			ДоступныеДвижения.Добавить(Движение);
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеДвижения.Количество() = 0 Тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДоступныеДвижения = ДокументОбъект.ЗаполнитьДвиженияПоДокументуОснованию(Модифицированность);
		ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	КонецЕсли;
	
	Если ДоступныеДвижения.Количество() > 0 Тогда
		Элементы.СтраницаПустаяСтраница.Видимость = Ложь;
		Для Каждого Движение Из ДоступныеДвижения Цикл
			ПоказатьТаблицуРегистраНаСтранице(Движение.Имя);
		КонецЦикла;
	Иначе
		УстановитьСтраницыРегистровДляДокументаБезДвижений();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьДвиженияПоДокументуОснованию()

// Процедура отображает на форме страницу для документа без движений
//
&НаСервере
Процедура УстановитьСтраницыРегистровДляДокументаБезДвижений()
	Элементы.СтраницаПустаяСтраница.Заголовок = НСтр("ru = 'У выбранного документа нет движений'");
	Элементы.СтраницаПустаяСтраница.Видимость = Истина;
	УдалитьСтраницыРегистров();
КонецПроцедуры // УстановитьСтраницыДокументаБезДвижений()

// Процедура удаляет страницы регистров на форме
//
&НаСервере
Процедура УдалитьСтраницыРегистров()
	// Уберем страницы
	Для каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Если НЕ (Страница.Имя = "СтраницаПустаяСтраница" ИЛИ Страница.Имя = "СтраницаДвиженияКорректировки" ИЛИ Страница.Имя = "СтраницаДополнительно") Тогда
			УдалитьСтраницуРегистра(Страница.Имя);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // УдалитьСтраницыРегистров()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	// Установим видимость в соответствии с Хозоперации.
	ЭтоКорректировка = (Объект.ХозОперация=Справочники.ХозОперации.КорректировкаДвижений);
	Элементы.СтраницаПустаяСтраница.Видимость = НЕ ЭтоКорректировка И НЕ ЕстьДвиженияДляКорректировки;
	Элементы.СтраницаДвиженияКорректировки.Видимость = ЭтоКорректировка;
	Элементы.ПараметрыДокумента.ТолькоПросмотр = НЕ ЭтоКорректировка;
	
	Если НЕ ЭтоКорректировка Тогда
		
		// Сторно 
		Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			Элементы.СтраницаПустаяСтраница.Заголовок = НСтр("ru = 'Не выбран документ-основание'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего на клиенте при выполнении команды "Установка флажка".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ИспользованиеИзменениеФлажка(Команда)
	
	УправлениеДиалогомКлиент.ГрупповоеИзменениеПоляФлажка(Объект.ДвиженияКорректировки, "Использование", Команда);
	
	Для каждого Движение Из Объект.ДвиженияКорректировки Цикл
		Если Движение.Использование Тогда
			ПоказатьТаблицуРегистраНаСтранице(Движение.ИмяРегистра);
		Иначе
			Объект.Движения[Движение.ИмяРегистра].Очистить();
			УдалитьСтраницуРегистра("Страница" + Движение.ИмяРегистра);
		КонецЕсли;
	КонецЦикла;
	
	// Настроим отображение командной панели
	Для каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Если Страница.Имя = "СтраницаПустаяСтраница" ИЛИ Страница.Имя = "СтраницаДвиженияКорректировки" Тогда
			Продолжить;
		КонецЕсли;
		Для каждого ТаблицаДвижений Из Страница.ПодчиненныеЭлементы Цикл
			ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, ТаблицаДвижений.Имя);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры // ИспользованиеИзменениеФлажка()

// Обработчик события возникающего при выполнении команды "Заполнить по документу" в контексте сервера.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаСервере
Процедура ЗаполнитьПоДокументуНаСервере()
	
	// Очистим движения
	Для каждого Движение Из Метаданные.Документы.КорректировкаДвижений.Движения Цикл
		Объект.Движения[Движение.Имя].Очистить();
		УдалитьСтраницуРегистра("Страница" + Движение.Имя);
	КонецЦикла;
	
	Для каждого Движение Из Объект.ДвиженияКорректировки Цикл
		Движение.Использование = Ложь;
	КонецЦикла;
	
	// отобразим движения по документу
	ЗаполнитьДвиженияПоДокументуОснованию();
	
КонецПроцедуры //ЗаполнитьПоДокументу()

// Обработчик события возникающего на клиенте при выполнении команды "Заполнить по документу".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ЗаполнитьПоДокументу(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ВывестиСообщение(НСтр("ru='Не выбран документ основание для заполнения.'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоДокументуНаСервере();
	
	// Настроим отображение командной панели
	Для каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Если Страница.Имя = "СтраницаПустаяСтраница" ИЛИ Страница.Имя = "СтраницаДвиженияКорректировки" Тогда
			Продолжить;
		КонецЕсли;
		Для каждого ТаблицаДвижений Из Страница.ПодчиненныеЭлементы Цикл
			ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, ТаблицаДвижений.Имя);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьПоДокументу()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.КорректировкаДвижений.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.КорректировкаДвижений.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Настроим отображение страниц
	Если Объект.ХозОперация = Справочники.ХозОперации.КорректировкаДвижений Тогда
		Для каждого Движение Из Объект.ДвиженияКорректировки Цикл
			Если Движение.Использование Тогда
				ПоказатьТаблицуРегистраНаСтранице(Движение.ИмяРегистра);
			Иначе
				УдалитьСтраницуРегистра("Страница" + Движение.ИмяРегистра);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого Движение Из Объект.ДвиженияКорректировки Цикл
			УдалитьСтраницуРегистра("Страница" + Движение.ИмяРегистра);
		КонецЦикла;
		ЗаполнитьДвиженияПоДокументуОснованию();
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Настроим отображение командной панели
	Для каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Если Страница.Имя = "СтраницаПустаяСтраница" ИЛИ Страница.Имя = "СтраницаДвиженияКорректировки" Тогда
			Продолжить;
		КонецЕсли;
		Для каждого ТаблицаДвижений Из Страница.ПодчиненныеЭлементы Цикл
			ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, ТаблицаДвижений.Имя);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Склад компании" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.КорректировкаДвижений.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
	// отобразим сторно движения
	Если Объект.ХозОперация = Справочники.ХозОперации.Сторно Тогда
		Для каждого Движение Из Объект.ДвиженияКорректировки Цикл
			УдалитьСтраницуРегистра("Страница" + Движение.ИмяРегистра);
		КонецЦикла;
		ЗаполнитьДвиженияПоДокументуОснованию();
	КонецЕсли;
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДокументОснованиеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Склад компании".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДокументОснованиеПриИзмененииНаСервере(ПараметрыДействия);
	
	// Настроим отображение командной панели
	Если Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.Сторно") Тогда
		Для каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
			Если Страница.Имя = "СтраницаПустаяСтраница" ИЛИ Страница.Имя = "СтраницаДвиженияКорректировки" Тогда
				Продолжить;
			КонецЕсли;
			Для каждого ТаблицаДвижений Из Страница.ПодчиненныеЭлементы Цикл
				ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, ТаблицаДвижений.Имя);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при окончании выбора данных реквизита "Документ основание" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервереБезКонтекста
Процедура ДокументОснованиеОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ Метаданные.Документы.КорректировкаДвижений.ВводитсяНаОсновании.Содержит(ВыбранноеЗначение.Метаданные()) Тогда
		ВывестиСообщение(НСтр("ru='Данный документ не может быть сторнирован.'"),,,,СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры //ДокументОснованиеОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при окончании выбора данных реквизита "Документ основание".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ТипЗнч(ВыбранноеЗначение) = Тип("Тип") И Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.Сторно") Тогда
		ДокументОснованиеОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры //ДокументОснованиеОбработкаВыбора()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ДВИЖЕНИЯ КОРРЕКТИРОВКИ"

// Обработчик события возникающего при изменении данных реквизита "Использование" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДвиженияКорректировкиИспользованиеПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.ДвиженияКорректировки.НайтиПоИдентификатору(Элементы.ДвиженияКорректировки.ТекущаяСтрока);
	
	Если ТекущиеДанные.Использование Тогда
		ПоказатьТаблицуРегистраНаСтранице(ТекущиеДанные.ИмяРегистра);
	Иначе
		Объект.Движения[ТекущиеДанные.ИмяРегистра].Очистить();
		УдалитьСтраницуРегистра("Страница" + ТекущиеДанные.ИмяРегистра);
	КонецЕсли;
	
КонецПроцедуры // ДвиженияКорректировкиИспользованиеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Использование".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДвиженияКорректировкиИспользованиеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ДвиженияКорректировкиИспользованиеПриИзмененииНаСервере();
	
	// Настроим отображение командной панели
	Для каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Если Страница.Имя = "СтраницаПустаяСтраница" ИЛИ Страница.Имя = "СтраницаДвиженияКорректировки" Тогда
			Продолжить;
		КонецЕсли;
		Для каждого ТаблицаДвижений Из Страница.ПодчиненныеЭлементы Цикл
			ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, ТаблицаДвижений.Имя);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ДвиженияКорректировкиИспользованиеПриИзменении()

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТаблицаДвиженийПриНачалеРедактирования(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Заполним организацию и подразделение по умолчанию
	Если НЕ Элемент.ПодчиненныеЭлементы.Найти(Элемент.Имя+"ПодразделениеКомпании")=Неопределено Тогда
		Если НЕ Элемент.ТекущиеДанные = Неопределено И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ПодразделениеКомпании) Тогда
			Элемент.ТекущиеДанные.ПодразделениеКомпании = Объект.ПодразделениеКомпании;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Элемент.ПодчиненныеЭлементы.Найти(Элемент.Имя+"Организация")=Неопределено Тогда
		Если НЕ Элемент.ТекущиеДанные = Неопределено И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Организация) Тогда
			Элемент.ТекущиеДанные.м = Объект.Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ТаблицаДвиженийПередНачаломДобавления()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоКорректировка = (Объект.ХозОперация=Справочники.ХозОперации.КорректировкаДвижений);
	Если (ЭтоКорректировка И НЕ РольПользователя("РазрешитьКорректировкуРегистров")) ИЛИ (НЕ ЭтоКорректировка И НЕ РольПользователя("РазрешитьСторнированиеДокументов")) Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Настроим отображение страниц
	Если Объект.ХозОперация = Справочники.ХозОперации.КорректировкаДвижений Тогда
		Для каждого Движение Из Объект.ДвиженияКорректировки Цикл
			Если Движение.Использование Тогда
				ПоказатьТаблицуРегистраНаСтранице(Движение.ИмяРегистра);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЗаполнитьДвиженияПоДокументуОснованию()
	КонецЕсли;
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим отображение командной панели
	Для каждого Страница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Если Страница.Имя = "СтраницаПустаяСтраница" ИЛИ Страница.Имя = "СтраницаДвиженияКорректировки" Тогда
			Продолжить;
		КонецЕсли;
		Для каждого ТаблицаДвижений Из Страница.ПодчиненныеЭлементы Цикл
			ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, ТаблицаДвижений.Имя);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	 	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
